[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:26:7
     const pages = new Set([0, totalPages - 1]);
     for (
       let i = Math.max(0, page - 2);
-      i <= Math.min(totalPages - 1, page + 2);
+      false;
       i++
     ) {
killedBy: AdminUsersPage tests pagination buttons change pages correctly
statusReason: Unable to find an accessible element with the role "button" and name "2"

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] EqualityOperator
main/pages/Admin/AdminUsersPage.jsx:26:7
     const pages = new Set([0, totalPages - 1]);
     for (
       let i = Math.max(0, page - 2);
-      i <= Math.min(totalPages - 1, page + 2);
+      i > Math.min(totalPages - 1, page + 2);
       i++
     ) {
killedBy: AdminUsersPage tests pagination buttons change pages correctly
statusReason: Unable to find an accessible element with the role "button" and name "2"

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.jsx:36:20
 
   const pageNumbers = getPageNumbers();
 
-  const btnStyle = (active) => ({
-    width: "36px",
-    height: "36px",
-    border: active
-      ? "0.5px solid var(--bs-primary, #0d6efd)"
-      : "1px solid #dee2e6",
-    borderRadius: "4px",
-    background: active ? "#0d6efd" : "white",
-    color: active ? "white" : "#212529",
-    fontWeight: active ? 500 : 400,
-    fontSize: "13px",
-    cursor: "pointer",
-    display: "inline-flex",
-    alignItems: "center",
-    justifyContent: "center",
-  });
+  const btnStyle = () => undefined;
 
   return (
killedBy: AdminUsersPage tests pagination buttons change pages correctly
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 500;

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/pages/Admin/AdminUsersPage.jsx:36:33
 
   const pageNumbers = getPageNumbers();
 
-  const btnStyle = (active) => ({
-    width: "36px",
-    height: "36px",
-    border: active
-      ? "0.5px solid var(--bs-primary, #0d6efd)"
-      : "1px solid #dee2e6",
-    borderRadius: "4px",
-    background: active ? "#0d6efd" : "white",
-    color: active ? "white" : "#212529",
-    fontWeight: active ? 500 : 400,
-    fontSize: "13px",
-    cursor: "pointer",
-    display: "inline-flex",
-    alignItems: "center",
-    justifyContent: "center",
-  });
+  const btnStyle = (active) => ({});
 
   return (
killedBy: AdminUsersPage tests pagination buttons change pages correctly
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 500;

Ignored nodes: comments, script, style

[Survived] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:38:13
 
   const btnStyle = (active) => ({
     width: "36px",
-    height: "36px",
+    height: "",
     border: active
       ? "0.5px solid var(--bs-primary, #0d6efd)"

[Survived] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:48:14
     fontWeight: active ? 500 : 400,
     fontSize: "13px",
     cursor: "pointer",
-    display: "inline-flex",
+    display: "",
     alignItems: "center",
     justifyContent: "center",

[Survived] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:49:17
     fontSize: "13px",
     cursor: "pointer",
     display: "inline-flex",
-    alignItems: "center",
+    alignItems: "",
     justifyContent: "center",
   });

[Survived] ObjectLiteral
main/pages/Admin/AdminUsersPage.jsx:60:16
       <UsersTable users={users} />
 
       <div
-        style={{
-          marginTop: "1rem",
-          display: "flex",
-          alignItems: "center",
-          gap: "4px",
-          flexWrap: "wrap",
-        }}
+        style={{}}
       >
         {/* Previous */}

[Survived] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:61:22
 
       <div
         style={{
-          marginTop: "1rem",
+          marginTop: "",
           display: "flex",
           alignItems: "center",

[Survived] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:62:20
       <div
         style={{
           marginTop: "1rem",
-          display: "flex",
+          display: "",
           alignItems: "center",
           gap: "4px",

[Survived] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:64:16
           marginTop: "1rem",
           display: "flex",
           alignItems: "center",
-          gap: "4px",
+          gap: "",
           flexWrap: "wrap",
         }}

[Killed] BlockStatement
main/pages/Admin/AdminUsersPage.jsx:78:36
           ‹
         </button>
 
-        {pageNumbers.map((p, i) => {
-          const prev = pageNumbers[i - 1];
-          return (
-            <React.Fragment key={p}>
-              {prev !== undefined && p - prev > 1 && (
-                <span
-                  style={{
-                    width: "36px",
-                    textAlign: "center",
-                    color: "#6c757d",
-                    fontSize: "13px",
-                  }}
-                >
-                  …
-                </span>
-              )}
-              <button style={btnStyle(p === page)} onClick={() => setPage(p)}>
-                {p + 1}
-              </button>
-            </React.Fragment>
-          );
-        })}
+        {pageNumbers.map((p, i) => {})}
 
         {/* Next */}
killedBy: AdminUsersPage tests pagination buttons change pages correctly
statusReason: Unable to find role="button" and name "1"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:82:16
           const prev = pageNumbers[i - 1];
           return (
             <React.Fragment key={p}>
-              {prev !== undefined && p - prev > 1 && (
-                <span
-                  style={{
-                    width: "36px",
-                    textAlign: "center",
-                    color: "#6c757d",
-                    fontSize: "13px",
-                  }}
-                >
-                  …
-                </span>
-              )}
+              {false}
               <button style={btnStyle(p === page)} onClick={() => setPage(p)}>
                 {p + 1}
killedBy: AdminUsersPage tests shows ellipsis when there are gaps between page numbers
statusReason: Unable to find an element with the text: …. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] ObjectLiteral
main/pages/Admin/AdminUsersPage.jsx:84:26
             <React.Fragment key={p}>
               {prev !== undefined && p - prev > 1 && (
                 <span
-                  style={{
-                    width: "36px",
-                    textAlign: "center",
-                    color: "#6c757d",
-                    fontSize: "13px",
-                  }}
+                  style={{}}
                 >
                   …

[Survived] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:86:32
                 <span
                   style={{
                     width: "36px",
-                    textAlign: "center",
+                    textAlign: "",
                     color: "#6c757d",
                     fontSize: "13px",

[Survived] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:88:31
                     width: "36px",
                     textAlign: "center",
                     color: "#6c757d",
-                    fontSize: "13px",
+                    fontSize: "",
                   }}
                 >
