[Killed] StringLiteral
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:9:8
 import SectionsTable from "main/components/Sections/SectionsTable";
 
 const objectToAxiosParams = (query) => ({
-  url: "/api/public/primariesge",
+  url: "",
   params: {
     qtr: query.quarter,
killedBy: GeneralEducationSearchPage tests logged in calls GE section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:16:46
   },
 });
 
-const LoggedInResults = ({ sectionJSON }) => {
-  const {
-    data: schedules,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    ["/api/personalschedules/all"],
-    { method: "GET", url: "/api/personalschedules/all" },
-    [],
-  );
-
-  return (
-    <SectionsTable
-      sections={sectionJSON}
-      schedules={schedules}
-      includeGeneralEducation={true}
-    />
-  );
-};
+const LoggedInResults = ({ sectionJSON }) => {};
 
 const LoggedOutResults = ({ sectionJSON }) => (
killedBy: GeneralEducationSearchPage tests logged in calls GE section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:31:32
     <SectionsTable
       sections={sectionJSON}
       schedules={schedules}
-      includeGeneralEducation={true}
+      includeGeneralEducation={false}
     />
   );
killedBy: GeneralEducationSearchPage tests logged in expands row and displays GE areas for lecture and discussion rows
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-generalEducation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:36:26
   );
 };
 
-const LoggedOutResults = ({ sectionJSON }) => (
-  <SectionsTable
-    sections={sectionJSON}
-    schedules={[]}
-    includeGeneralEducation={true}
-  />
-);
+const LoggedOutResults = () => undefined;
 
 export default function GeneralEducationSearchPage() {
killedBy: GeneralEducationSearchPage tests logged out calls GE section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:40:30
   <SectionsTable
     sections={sectionJSON}
     schedules={[]}
-    includeGeneralEducation={true}
+    includeGeneralEducation={false}
   />
 );
killedBy: GeneralEducationSearchPage tests logged out expands row and displays GE areas for lecture and discussion rows
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-generalEducation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrayDeclaration
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:46:50
 
 export default function GeneralEducationSearchPage() {
   const { data: currentUser } = useCurrentUser();
-  const [sectionJSON, setSectionJSON] = useState([]);
+  const [sectionJSON, setSectionJSON] = useState(["Stryker was here"]);
 
   const onSuccess = (section) => {
killedBy: GeneralEducationSearchPage tests logged in renders without crashing
statusReason: Cannot use 'in' operator to search for 'primary' in Stryker was here

[Killed] BlockStatement
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:59:52
     [],
   );
 
-  async function fetchGESectionJSON(_event, query) {
-    mutation.mutate(query);
-  }
+  async function fetchGESectionJSON(_event, query) {}
 
   const isLoggedIn = hasRole(currentUser, "ROLE_USER");
killedBy: GeneralEducationSearchPage tests logged in calls GE section search api correctly with 1 section response
statusReason: expected 0 to be greater than or equal to 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
