[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.jsx:80:34
         {/* Previous */}
         <button
           style={btnStyle(false)}
-          onClick={() => setPage((p) => Math.max(p - 1, 0))}
+          onClick={() => setPage(() => undefined)}
           disabled={page === 0}
           title="Previous page"
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: Unable to find role="button" and name "2"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:80:50
         {/* Previous */}
         <button
           style={btnStyle(false)}
-          onClick={() => setPage((p) => Math.max(p - 1, 0))}
+          onClick={() => setPage((p) => Math.max(p + 1, 0))}
           disabled={page === 0}
           title="Previous page"
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: Unable to find role="button" and name "2"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/Admin/AdminUsersPage.jsx:81:21
         <button
           style={btnStyle(false)}
           onClick={() => setPage((p) => Math.max(p - 1, 0))}
-          disabled={page === 0}
+          disabled={page !== 0}
           title="Previous page"
         >
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  style="width: 36px; height: 36px; border: 1px solid rgb(222, 226, 230); border-radius: 4px; background: white; color: rgb(33, 37, 41); font-weight: 400; font-size: 13px; cursor: pointer; display: inline-flex; align-items: center; justify-content: center;"
  title="Previous page"
/>

[Killed] BlockStatement
main/pages/Admin/AdminUsersPage.jsx:87:36
           ‹
         </button>
 
-        {pageNumbers.map((p, i) => {
-          const prev = pageNumbers[i - 1];
-          return (
-            <React.Fragment key={p}>
-              {prev !== undefined && p - prev > 1 && (
-                <span style={ellipsisStyle}>…</span>
-              )}
-              <button style={btnStyle(p === page)} onClick={() => setPage(p)}>
-                {p + 1}
-              </button>
-            </React.Fragment>
-          );
-        })}
+        {pageNumbers.map((p, i) => {})}
 
         {/* Next */}
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: Unable to find role="button" and name "1"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:88:36
         </button>
 
         {pageNumbers.map((p, i) => {
-          const prev = pageNumbers[i - 1];
+          const prev = pageNumbers[i + 1];
           return (
             <React.Fragment key={p}>
killedBy: AdminUsersPage tests page buttons are sorted and ellipsis appears for gaps
statusReason: Unable to find an element with the text: …. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:91:38
           const prev = pageNumbers[i - 1];
           return (
             <React.Fragment key={p}>
-              {prev !== undefined && p - prev > 1 && (
+              {prev !== undefined && true && (
                 <span style={ellipsisStyle}>…</span>
               )}
killedBy: AdminUsersPage tests page buttons are sorted and ellipsis appears for gaps
statusReason: Found multiple elements with the text: …

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  style="width: 36px; text-align: center; color: rgb(108, 117, 125); font-size: 13px;"
>

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:91:16
           const prev = pageNumbers[i - 1];
           return (
             <React.Fragment key={p}>
-              {prev !== undefined && p - prev > 1 && (
-                <span style={ellipsisStyle}>…</span>
-              )}
+              {true}
               <button style={btnStyle(p === page)} onClick={() => setPage(p)}>
                 {p + 1}
killedBy: AdminUsersPage tests page buttons are sorted and ellipsis appears for gaps
statusReason: Unable to find an element with the text: …. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.jsx:94:61
               {prev !== undefined && p - prev > 1 && (
                 <span style={ellipsisStyle}>…</span>
               )}
-              <button style={btnStyle(p === page)} onClick={() => setPage(p)}>
+              <button style={btnStyle(p === page)} onClick={() => undefined}>
                 {p + 1}
               </button>
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 500;
+ font-weight: 400;

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:94:39
               {prev !== undefined && p - prev > 1 && (
                 <span style={ellipsisStyle}>…</span>
               )}
-              <button style={btnStyle(p === page)} onClick={() => setPage(p)}>
+              <button style={btnStyle(false)} onClick={() => setPage(p)}>
                 {p + 1}
               </button>
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 500;
+ font-weight: 400;

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:105:21
         <button
           style={btnStyle(false)}
           onClick={() => setPage(page + 1)}
-          disabled={page >= totalPages - 1}
+          disabled={false}
           title="Next page"
         >
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  style="width: 36px; height: 36px; border: 1px solid rgb(222, 226, 230); border-radius: 4px; background: white; color: rgb(33, 37, 41); font-weight: 400; font-size: 13px; cursor: pointer; display: inline-flex; align-items: center; justify-content: center;"
  title="Next page"
/>

[Killed] EqualityOperator
main/pages/Admin/AdminUsersPage.jsx:105:21
         <button
           style={btnStyle(false)}
           onClick={() => setPage(page + 1)}
-          disabled={page >= totalPages - 1}
+          disabled={page > totalPages - 1}
           title="Next page"
         >
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  style="width: 36px; height: 36px; border: 1px solid rgb(222, 226, 230); border-radius: 4px; background: white; color: rgb(33, 37, 41); font-weight: 400; font-size: 13px; cursor: pointer; display: inline-flex; align-items: center; justify-content: center;"
  title="Next page"
/>
