[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:48:17
 };
 
 const onError = (error) => {
-  console.error("onError: error=", error);
+  console.error("", error);
   const message =
     error.response.data?.message ||
killedBy: SectionsTable tests onError passed into useBackendMutation displays error message from response.data.message
statusReason: expected "error" to be called with arguments: [ 'onError: error=', …(1) ]

Received:

  1st error call:

@@ -1,7 +1,7 @@
  [

[Killed] OptionalChaining
main/components/Sections/SectionsTable.jsx:50:5
 const onError = (error) => {
   console.error("onError: error=", error);
   const message =
-    error.response.data?.message ||
+    error.response.data.message ||
     `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
   toast.error(message);
killedBy: SectionsTable tests onError passed into useBackendMutation falls back to generic error message when no response data
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:55:41
   toast.error(message);
 };
 
-const formatGeneralEducation = (row) => {
-  const primaryRow =
-    row.depth === 0 ? row.original : row.getParentRow()?.original;
-  const geList = primaryRow?.generalEducation;
-
-  if (!Array.isArray(geList) || geList.length === 0) {
-    return "";
-  }
-
-  return geList
-    .map((ge) => {
-      const college = ge?.geCollege?.trim?.();
-
-      return college;
-    })
-    .filter(Boolean)
-    .join(", ");
-};
+const formatGeneralEducation = (row) => {};
 
 export default function SectionsTable({
killedBy: GeneralEducationSearchPage tests logged in expands row and displays GE areas for lecture and discussion rows
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:57:5
 
 const formatGeneralEducation = (row) => {
   const primaryRow =
-    row.depth === 0 ? row.original : row.getParentRow()?.original;
+    false ? row.original : row.getParentRow()?.original;
   const geList = primaryRow?.generalEducation;
 
killedBy: GeneralEducationSearchPage tests logged in expands row and displays GE areas for lecture and discussion rows
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
main/components/Sections/SectionsTable.jsx:57:5
 
 const formatGeneralEducation = (row) => {
   const primaryRow =
-    row.depth === 0 ? row.original : row.getParentRow()?.original;
+    row.depth !== 0 ? row.original : row.getParentRow()?.original;
   const geList = primaryRow?.generalEducation;
 
killedBy: GeneralEducationSearchPage tests logged in expands row and displays GE areas for lecture and discussion rows
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Timeout] OptionalChaining
main/components/Sections/SectionsTable.jsx:58:18
 const formatGeneralEducation = (row) => {
   const primaryRow =
     row.depth === 0 ? row.original : row.getParentRow()?.original;
-  const geList = primaryRow?.generalEducation;
+  const geList = primaryRow.generalEducation;
 
   if (!Array.isArray(geList) || geList.length === 0) {

[Killed] EqualityOperator
main/components/Sections/SectionsTable.jsx:60:33
     row.depth === 0 ? row.original : row.getParentRow()?.original;
   const geList = primaryRow?.generalEducation;
 
-  if (!Array.isArray(geList) || geList.length === 0) {
+  if (!Array.isArray(geList) || geList.length !== 0) {
     return "";
   }
killedBy: GeneralEducationSearchPage tests logged in expands row and displays GE areas for lecture and discussion rows
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
main/components/Sections/SectionsTable.jsx:60:7
     row.depth === 0 ? row.original : row.getParentRow()?.original;
   const geList = primaryRow?.generalEducation;
 
-  if (!Array.isArray(geList) || geList.length === 0) {
+  if (Array.isArray(geList) || geList.length === 0) {
     return "";
   }
killedBy: GeneralEducationSearchPage tests logged in expands row and displays GE areas for lecture and discussion rows
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Timeout] MethodExpression
main/components/Sections/SectionsTable.jsx:64:10
     return "";
   }
 
-  return geList
-    .map((ge) => {
-      const college = ge?.geCollege?.trim?.();
-
-      return college;
-    })
-    .filter(Boolean)
+  return geList.map(ge => {
+  const college = ge?.geCollege?.trim?.();
+  return college;
+})
     .join(", ");
 };

[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:65:18
   }
 
   return geList
-    .map((ge) => {
-      const college = ge?.geCollege?.trim?.();
-
-      return college;
-    })
+    .map((ge) => {})
     .filter(Boolean)
     .join(", ");
killedBy: GeneralEducationSearchPage tests logged in expands row and displays GE areas for lecture and discussion rows
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Timeout] OptionalChaining
main/components/Sections/SectionsTable.jsx:66:23
 
   return geList
     .map((ge) => {
-      const college = ge?.geCollege?.trim?.();
+      const college = ge?.geCollege.trim?.();
 
       return college;

[Timeout] OptionalChaining
main/components/Sections/SectionsTable.jsx:66:23
 
   return geList
     .map((ge) => {
-      const college = ge?.geCollege?.trim?.();
+      const college = ge.geCollege?.trim?.();
 
       return college;

[Killed] ArrayDeclaration
main/components/Sections/SectionsTable.jsx:76:15
 
 export default function SectionsTable({
   sections,
-  schedules = [],
+  schedules = ["Stryker was here"],
   includeGeneralEducation = false,
 }) {
killedBy: SectionsTable tests onError passed into useBackendMutation displays error message from response.data.message
statusReason: schedules prop must be an array of objects with an 'id' property

[Timeout] BooleanLiteral
main/components/Sections/SectionsTable.jsx:77:29
 export default function SectionsTable({
   sections,
   schedules = [],
-  includeGeneralEducation = false,
+  includeGeneralEducation = true,
 }) {
   if (!(schedules instanceof Array)) {

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:79:7
   schedules = [],
   includeGeneralEducation = false,
 }) {
-  if (!(schedules instanceof Array)) {
+  if (false) {
     throw new Error("schedules prop must be an array");
   }
killedBy: SectionsTable tests Section Table tests Error checking that schedules is an array works
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
main/components/Sections/SectionsTable.jsx:79:7
   schedules = [],
   includeGeneralEducation = false,
 }) {
-  if (!(schedules instanceof Array)) {
+  if (schedules instanceof Array) {
     throw new Error("schedules prop must be an array");
   }
killedBy: SectionSearchesIndexPageLoggedIn tests renders without crashing
statusReason: schedules prop must be an array

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:83:7
     throw new Error("schedules prop must be an array");
   }
 
-  if (schedules.length > 0 && !Object.hasOwn(schedules[0], "id")) {
+  if (false) {
     throw new Error(
       "schedules prop must be an array of objects with an 'id' property",
killedBy: SectionsTable tests Section Table tests Error checking that schedules is an array of objects with id property works
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:97:23
   );
 
   const addToScheduleCallback = (section, schedule, mutation) => {
-    const dataFinal = {
-      enrollCd: section.enrollCode,
-      psId: schedule,
-    };
+    const dataFinal = {};
     mutation.mutate(dataFinal);
   };
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expected "vi.fn()" to be called with arguments: [ { enrollCd: '30262', psId: 1 } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:116:43
             onClick: table.getToggleAllRowsExpandedHandler(),
           }}
         >
-          {table.getIsAllRowsExpanded() ? "➖" : "➕"}
+          {table.getIsAllRowsExpanded() ? "" : "➕"}
         </button>
       ),
killedBy: SectionsTable tests Section Table tests Expand all button works properly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ➖
Received:

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:137:5
       // We'll apply this style in the render, but you can define it here too
       // For sub-rows, you might want to adjust cell content for clarity
     },
-    {
-      header: "Quarter",
-      accessorKey: "quarter",
-      cell: ({ row }) =>
-        row.original.quarter ? yyyyqToQyy(row.original.quarter) : "",
-    },
+    {},
     {
       accessorKey: "courseId",
killedBy: GeneralEducationSearchPage tests logged in renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:143:5
       cell: ({ row }) =>
         row.original.quarter ? yyyyqToQyy(row.original.quarter) : "",
     },
-    {
-      accessorKey: "courseId",
-      header: "Course ID",
-      cell: ({ row }) => {
-        return renderDetailPageLink(row, testid);
-      },
-    },
+    {},
     {
       accessorKey: "title",
killedBy: SectionSearchesIndexPageLoggedIn tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:156:11
     },
     ...(includeGeneralEducation
       ? [
-          {
-            id: "generalEducation",
-            header: "GE Areas",
-            cell: ({ row }) => formatGeneralEducation(row),
-          },
+          {},
         ]
       : []),
killedBy: GeneralEducationSearchPage tests logged in renders without crashing
statusReason: Columns require an id when using a non-string header

[Timeout] StringLiteral
main/components/Sections/SectionsTable.jsx:158:21
       ? [
           {
             id: "generalEducation",
-            header: "GE Areas",
+            header: "",
             cell: ({ row }) => formatGeneralEducation(row),
           },

[Killed] ArrowFunction
main/components/Sections/SectionsTable.jsx:159:19
           {
             id: "generalEducation",
             header: "GE Areas",
-            cell: ({ row }) => formatGeneralEducation(row),
+            cell: () => undefined,
           },
         ]
killedBy: GeneralEducationSearchPage tests logged in expands row and displays GE areas for lecture and discussion rows
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrayDeclaration
main/components/Sections/SectionsTable.jsx:162:9
             cell: ({ row }) => formatGeneralEducation(row),
           },
         ]
-      : []),
+      : ["Stryker was here"]),
     {
       header: "Status",
killedBy: SectionsTable tests objectToAxiosParams wired into useBackendMutation passes a function that builds correct axios params
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:175:15
     },
     {
       id: "location",
-      header: "Location",
+      header: "",
       cell: ({ row }) => formatLocation(getSection(row).timeLocations),
     },
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Unable to find an element with the text: Location. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:183:5
       header: "Days",
       cell: ({ row }) => formatDays(getSection(row).timeLocations),
     },
-    {
-      id: "time",
-      header: "Time",
-      cell: ({ row }) => formatTime(getSection(row).timeLocations),
-    },
+    {},
     {
       id: "instructor",
killedBy: SectionsTable tests objectToAxiosParams wired into useBackendMutation passes a function that builds correct axios params
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:189:11
       cell: ({ row }) => formatTime(getSection(row).timeLocations),
     },
     {
-      id: "instructor",
+      id: "",
       header: "Instructor",
       cell: ({ row }) => formatInstructors(getSection(row).instructors),
killedBy: GeneralEducationSearchPage tests logged in renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:190:15
     },
     {
       id: "instructor",
-      header: "Instructor",
+      header: "",
       cell: ({ row }) => formatInstructors(getSection(row).instructors),
     },
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Unable to find an element with the text: Instructor. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:200:11
     },
     {
       header: "Info",
-      id: "info",
+      id: "",
       cell: ({ row }) => renderInfoLink(row, testid),
     },
killedBy: SectionSearchesIndexPageLoggedIn tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:203:5
       id: "info",
       cell: ({ row }) => renderInfoLink(row, testid),
     },
-    {
-      header: "Action",
-      id: "action",
-      cell: ({ row }) => {
-        if (!currentUser.loggedIn) {
-          return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
-        } else if (!shouldShowAddToScheduleLink(row)) {
-          return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
-        }
-        return (
-          <div className="d-flex align-items-center gap-2">
-            <AddToScheduleModal
-              section={getSection(row)}
-              quarter={getQuarter(row)}
-              onAdd={(section, schedule) =>
-                addToScheduleCallback(section, schedule, mutation)
-              }
-              schedules={schedules}
-              testid={`${testid}-cell-row-${row.id}-col-action`}
-            />
-          </div>
-        );
-      },
-    },
+    {},
   ];
   return (
killedBy: SectionsTable tests objectToAxiosParams wired into useBackendMutation passes a function that builds correct axios params
statusReason: Columns require an id when using a non-string header

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:209:20
       cell: ({ row }) => {
         if (!currentUser.loggedIn) {
           return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
-        } else if (!shouldShowAddToScheduleLink(row)) {
+        } else if (true) {
           return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
         }
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-add-to-schedule-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"
