[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:207:36
       header: "Action",
       id: "action",
       cell: ({ row }) => {
-        if (!currentUser.loggedIn) {
-          return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
-        } else if (!shouldShowAddToScheduleLink(row)) {
+        if (!currentUser.loggedIn) {} else if (!shouldShowAddToScheduleLink(row)) {
           return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
         }
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="SectionsTable-row-0-not-logged-in"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"
