[Killed] ObjectLiteral
main/components/Nav/AppNavbar.jsx:31:20
             data-testid="AppNavbarImage"
             src={headerImg}
             alt=""
-            style={{ width: 80, height: 80, marginRight: 10 }}
+            style={{}}
           />
           <Navbar.Brand as={Link} to="/">
killedBy: AppNavbar tests renders image correctly
statusReason: expect(element).toHaveAttribute("style", "width: 80px; height: 80px; margin-right: 10px;") // element.getAttribute("style") === "width: 80px; height: 80px; margin-right: 10px;"

Expected the element to have attribute:
  style="width: 80px; height: 80px; margin-right: 10px;"
Received:
  null

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:45:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="me-auto">
-              {systemInfo?.springH2ConsoleEnabled && (
-                <>
-                  <Nav.Link href="/h2-console/index.html">H2Console </Nav.Link>
-                </>
-              )}
+              {systemInfo?.springH2ConsoleEnabled || <>
+                  <Nav.Link href="/h2-console/index.html">H2Console </Nav.Link>
+                </>}
               {systemInfo?.showSwaggerUILink && (
                 <>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] OptionalChaining
main/components/Nav/AppNavbar.jsx:50:16
                   <Nav.Link href="/h2-console/index.html">H2Console </Nav.Link>
                 </>
               )}
-              {systemInfo?.showSwaggerUILink && (
+              {systemInfo.showSwaggerUILink && (
                 <>
                   <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
killedBy: CSVDownloadsPage tests uses fallback quarters when systemInfo is unavailable
statusReason: Cannot read properties of null (reading 'showSwaggerUILink')

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:58:16
             </Nav>
 
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_USER") && (
-                <Nav.Link
-                  href="/personalschedules/list"
-                  data-testid="appnavbar-personalschedules-list"
-                >
-                  Personal Schedules
-                </Nav.Link>
-              )}
+              {false}
               <Nav.Link href="/" data-testid="appnavbar-mainsearch-list">
                 Main Search
killedBy: AppNavbar tests renders Personal Schedules and Courses links correctly for regular logged in user
statusReason: Unable to find an element with the text: Personal Schedules. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:167:16
               <Nav.Link href="/downloads" data-testid="appnavbar-downloads">
                 Downloads
               </Nav.Link>
-              {currentUser && currentUser.loggedIn ? (
+              {true ? (
                 <>
                   <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: SectionSearchesIndexPageLoggedIn tests renders without crashing
statusReason: Cannot read properties of null (reading 'user')

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:167:16
               <Nav.Link href="/downloads" data-testid="appnavbar-downloads">
                 Downloads
               </Nav.Link>
-              {currentUser && currentUser.loggedIn ? (
+              {currentUser || currentUser.loggedIn ? (
                 <>
                   <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: CourseOverTimeIndexPage tests renders without crashing
statusReason: Cannot read properties of null (reading 'user')
