[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:126:19
 function buildGroupedSectionRows(flatSections) {
   const sectionsByCourse = new Map();
 
-  for (let j = 0; j < flatSections.length; j++) {
+  for (let j = 0; false; j++) {
     const entry = flatSections[j];
     if (isLectureSectionCode(entry.section.section)) {
killedBy: ConvertedSectionTable tests groupSectionsUnderLectures shows lectures and hides sections until expanded
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-row-1-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:128:54
 
   for (let j = 0; j < flatSections.length; j++) {
     const entry = flatSections[j];
-    if (isLectureSectionCode(entry.section.section)) {
-      continue;
-    }
+    if (isLectureSectionCode(entry.section.section)) {}
 
     const key = courseKey(entry.courseInfo.quarter, entry.courseInfo.courseId);
killedBy: ConvertedSectionTable tests expander row buttons toggle individual lectures
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-row-0-cannot-expand"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:133:37
     }
 
     const key = courseKey(entry.courseInfo.quarter, entry.courseInfo.courseId);
-    if (!sectionsByCourse.has(key)) {
-      sectionsByCourse.set(key, []);
-    }
+    if (!sectionsByCourse.has(key)) {}
     sectionsByCourse.get(key).push(entry);
   }
killedBy: ConvertedSectionTable tests groupSectionsUnderLectures shows lectures and hides sections until expanded
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] EqualityOperator
main/components/Common/ConvertedSectionTable.jsx:141:19
 
   const result = [];
 
-  for (let i = 0; i < flatSections.length; i++) {
+  for (let i = 0; i <= flatSections.length; i++) {
     const entry = flatSections[i];
     const sectionCode = entry.section.section;
killedBy: ConvertedSectionTable tests groupSectionsUnderLectures shows lectures and hides sections until expanded
statusReason: Cannot read properties of undefined (reading 'section')

[Killed] EqualityOperator
main/components/Common/ConvertedSectionTable.jsx:141:19
 
   const result = [];
 
-  for (let i = 0; i < flatSections.length; i++) {
+  for (let i = 0; i >= flatSections.length; i++) {
     const entry = flatSections[i];
     const sectionCode = entry.section.section;
killedBy: ConvertedSectionTable tests groupSectionsUnderLectures shows lectures and hides sections until expanded
statusReason: Unable to find an element with the text: 0100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:145:9
     const entry = flatSections[i];
     const sectionCode = entry.section.section;
 
-    if (!isLectureSectionCode(sectionCode)) {
+    if (true) {
       continue;
     }
killedBy: ConvertedSectionTable tests groupSectionsUnderLectures shows lectures and hides sections until expanded
statusReason: Unable to find an element with the text: 0100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] ArrayDeclaration
main/components/Common/ConvertedSectionTable.jsx:167:5
 function GroupedConvertedSectionTable({ sections }) {
   const groupedData = useMemo(
     () => buildGroupedSectionRows(sections),
-    [sections],
+    [],
   );
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:182:4
 function ConvertedSectionTable({
   sections,
   groupSectionsUnderLectures = false,
-}) {
-  if (groupSectionsUnderLectures) {
-    return <GroupedConvertedSectionTable sections={sections} />;
-  }
-
-  return (
-    <OurTable data={sections} columns={BASE_COLUMNS} testid={TESTID} />
-  );
-}
+}) {}
 
 export default ConvertedSectionTable;
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:183:7
   sections,
   groupSectionsUnderLectures = false,
 }) {
-  if (groupSectionsUnderLectures) {
+  if (false) {
     return <GroupedConvertedSectionTable sections={sections} />;
   }
killedBy: ConvertedSectionTable tests groupSectionsUnderLectures shows lectures and hides sections until expanded
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="ConvertedSectionTable-cell-row-2-col-section"
>
  0101
</td> instead
