[Killed] ArrayDeclaration
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:14:5
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/personalschedules/all"],
+    [],
     { method: "GET", url: "/api/personalschedules/all" },
     [],
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] StringLiteral
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:14:6
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/personalschedules/all"],
+    [""],
     { method: "GET", url: "/api/personalschedules/all" },
     [],
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

@@ -1,8 +1,8 @@
  [

[Killed] ObjectLiteral
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:15:5
     status: _status,
   } = useBackend(
     ["/api/personalschedules/all"],
-    { method: "GET", url: "/api/personalschedules/all" },
+    {},
     [],
   );
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

  [
    [

[Killed] StringLiteral
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:15:27
     status: _status,
   } = useBackend(
     ["/api/personalschedules/all"],
-    { method: "GET", url: "/api/personalschedules/all" },
+    { method: "GET", url: "" },
     [],
   );
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

@@ -2,9 +2,9 @@
    [

[Killed] ArrayDeclaration
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:19:50
     [],
   );
 
-  const [sectionJSON, setSectionJSON] = useState([]);
+  const [sectionJSON, setSectionJSON] = useState(["Stryker was here"]);
   const [hasSearched, setHasSearched] = useState(false);
 
killedBy: SectionSearchesIndexPageLoggedIn tests renders without crashing
statusReason: Cannot use 'in' operator to search for 'primary' in Stryker was here

[Killed] BooleanLiteral
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:20:50
   );
 
   const [sectionJSON, setSectionJSON] = useState([]);
-  const [hasSearched, setHasSearched] = useState(false);
+  const [hasSearched, setHasSearched] = useState(true);
 
   const objectToAxiosParams = (query) => ({
killedBy: SectionSearchesIndexPageLoggedIn tests does not display 'No sections found' message before search is performed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  No sections were found with the specified criteria.
</p> instead

[Killed] ArrowFunction
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:22:31
   const [sectionJSON, setSectionJSON] = useState([]);
   const [hasSearched, setHasSearched] = useState(false);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/primaries",
-    params: {
-      qtr: query.quarter,
-      dept: query.subject,
-      level: query.level,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (section) => {
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: expected undefined to deeply equal { qtr: '20222', dept: 'ANTH', …(1) }

[Killed] BlockStatement
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:31:34
     },
   });
 
-  const onSuccess = (section) => {
-    setSectionJSON(section);
-    setHasSearched(true);
-  };
+  const onSuccess = (section) => {};
 
   const mutation = useBackendMutation(
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:33:20
 
   const onSuccess = (section) => {
     setSectionJSON(section);
-    setHasSearched(true);
+    setHasSearched(false);
   };
 
killedBy: SectionSearchesIndexPageLoggedIn tests displays 'No sections found' message when search returns empty results
statusReason: Unable to find an element with the text: /No sections were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:53:10
         <BasicCourseSearchForm fetchJSON={fetchBasicSectionJSON} />
 
         {/* Loading state */}
-        {mutation.isLoading && (
-          <div className="text-center">Loading courses...</div>
-        )}
+        {false}
 
         {/* No results message */}
killedBy: SectionSearchesIndexPageLoggedIn tests displays 'No sections found' message when search returns empty results
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:53:10
         <BasicCourseSearchForm fetchJSON={fetchBasicSectionJSON} />
 
         {/* Loading state */}
-        {mutation.isLoading && (
-          <div className="text-center">Loading courses...</div>
-        )}
+        {true}
 
         {/* No results message */}
killedBy: SectionSearchesIndexPageLoggedIn tests displays 'No sections found' message when search returns empty results
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:58:10
         )}
 
         {/* No results message */}
-        {!mutation.isLoading && hasSearched && sectionJSON.length === 0 && (
+        {!mutation.isLoading || hasSearched && sectionJSON.length === 0 && (
           <div className="text-center mt-3">
             <p>No sections were found with the specified criteria.</p>
killedBy: SectionSearchesIndexPageLoggedIn tests does not display 'No sections found' message before search is performed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  No sections were found with the specified criteria.
</p> instead

[Killed] LogicalOperator
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:58:10
         )}
 
         {/* No results message */}
-        {!mutation.isLoading && hasSearched && sectionJSON.length === 0 && (
+        {!mutation.isLoading && hasSearched || sectionJSON.length === 0 && (
           <div className="text-center mt-3">
             <p>No sections were found with the specified criteria.</p>
killedBy: SectionSearchesIndexPageLoggedIn tests displays 'No sections found' message when search returns empty results
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:64:33
           </div>
         )}
 
-        {!mutation.isLoading && sectionJSON.length > 0 && (
+        {!mutation.isLoading && true && (
           <SectionsTable sections={sectionJSON} schedules={schedules} />
         )}
killedBy: SectionSearchesIndexPageLoggedIn tests does not display BasicCourseTable when search returns empty results
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th
  colspan="1"
>
  Course ID
</th> instead

[Killed] BooleanLiteral
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:64:10
           </div>
         )}
 
-        {!mutation.isLoading && sectionJSON.length > 0 && (
+        {mutation.isLoading && sectionJSON.length > 0 && (
           <SectionsTable sections={sectionJSON} schedules={schedules} />
         )}
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
