[Killed] ObjectLiteral
main/pages/SectionSearches/SectionSearchesIndexPageNotLoggedIn.jsx:14:13
 
   const objectToAxiosParams = (query) => ({
     url: "/api/public/primaries",
-    params: {
-      qtr: query.quarter,
-      dept: query.subject,
-      level: query.level,
-    },
+    params: {},
   });
 
killedBy: SectionSearchesIndexPageNotLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: expected {} to deeply equal { qtr: '20222', dept: 'ANTH', …(1) }

[Killed] LogicalOperator
main/pages/SectionSearches/SectionSearchesIndexPageNotLoggedIn.jsx:43:10
         <BasicCourseSearchForm fetchJSON={fetchBasicSectionJSON} />
 
         {/* Loading state */}
-        {mutation.isLoading && (
-          <div className="text-center">Loading courses...</div>
-        )}
+        {mutation.isLoading || <div className="text-center">Loading courses...</div>}
 
         {/* No results message */}
killedBy: SectionSearchesIndexPageNotLoggedIn tests does not display 'No sections found' message before search is performed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center"
>
  Loading courses...
</div> instead

[Killed] ConditionalExpression
main/pages/SectionSearches/SectionSearchesIndexPageNotLoggedIn.jsx:48:10
         )}
 
         {/* No results message */}
-        {!mutation.isLoading && hasSearched && sectionJSON.length === 0 && (
-          <div className="text-center mt-3">
-            <p>No sections were found with the specified criteria.</p>
-          </div>
-        )}
+        {true}
 
         {!mutation.isLoading && sectionJSON.length > 0 && (
killedBy: SectionSearchesIndexPageNotLoggedIn tests displays 'No sections found' message when search returns empty results
statusReason: Unable to find an element with the text: /No sections were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/SectionSearches/SectionSearchesIndexPageNotLoggedIn.jsx:48:10
         )}
 
         {/* No results message */}
-        {!mutation.isLoading && hasSearched && sectionJSON.length === 0 && (
+        {true && (
           <div className="text-center mt-3">
             <p>No sections were found with the specified criteria.</p>
killedBy: SectionSearchesIndexPageNotLoggedIn tests displays 'No sections found' message when search returns empty results
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/SectionSearches/SectionSearchesIndexPageNotLoggedIn.jsx:54:10
           </div>
         )}
 
-        {!mutation.isLoading && sectionJSON.length > 0 && (
-          <SectionsTable sections={sectionJSON} />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: SectionSearchesIndexPageNotLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
