[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:14:20
 
 export default function CSVDownloadsPage() {
   const { data: systemInfo } = useSystemInfo();
-  const startQtr = systemInfo?.startQtrYYYYQ || "20084";
+  const startQtr = false;
   const endQtr = systemInfo?.endQtrYYYYQ || "20262";
   const quarters = quarterRange(startQtr, endQtr);
killedBy: CSVDownloadsPage tests renders correctly
statusReason: param should be a string

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:14:20
 
 export default function CSVDownloadsPage() {
   const { data: systemInfo } = useSystemInfo();
-  const startQtr = systemInfo?.startQtrYYYYQ || "20084";
+  const startQtr = true;
   const endQtr = systemInfo?.endQtrYYYYQ || "20262";
   const quarters = quarterRange(startQtr, endQtr);
killedBy: CSVDownloadsPage tests renders correctly
statusReason: param should be a string

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:15:18
 export default function CSVDownloadsPage() {
   const { data: systemInfo } = useSystemInfo();
   const startQtr = systemInfo?.startQtrYYYYQ || "20084";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20262";
+  const endQtr = false;
   const quarters = quarterRange(startQtr, endQtr);
 
killedBy: CSVDownloadsPage tests renders correctly
statusReason: param should be a string

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:15:18
 export default function CSVDownloadsPage() {
   const { data: systemInfo } = useSystemInfo();
   const startQtr = systemInfo?.startQtrYYYYQ || "20084";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20262";
+  const endQtr = true;
   const quarters = quarterRange(startQtr, endQtr);
 
killedBy: CSVDownloadsPage tests renders correctly
statusReason: param should be a string

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:24:27
     status: _status,
   } = useBackend(
     ["/api/UCSBSubjects/all"],
-    { method: "GET", url: "/api/UCSBSubjects/all" },
+    { method: "GET", url: "" },
     [],
   );
killedBy: CSVDownloadsPage tests renders correctly
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/UCSBSubjects/all' ], …(2) ]

Received:

  1st useBackend call:

@@ -2,9 +2,9 @@
    [

[Killed] ArrayDeclaration
main/pages/CSV/CSVDownloadsPage.jsx:25:5
   } = useBackend(
     ["/api/UCSBSubjects/all"],
     { method: "GET", url: "/api/UCSBSubjects/all" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: CSVDownloadsPage tests renders correctly
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:28:51
     [],
   );
 
-  const localSearchQuarter = localStorage.getItem("CSVDownloads.Quarter");
+  const localSearchQuarter = localStorage.getItem("");
   const localSearchSubject = localStorage.getItem("CSVDownloads.Subject");
   const localLevel = localStorage.getItem("CSVDownloads.Level");
killedBy: CSVDownloadsPage tests loads state from localStorage when available
statusReason: Unable to find an element with the display value: S18.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:31:50
   const localSearchQuarter = localStorage.getItem("CSVDownloads.Quarter");
   const localSearchSubject = localStorage.getItem("CSVDownloads.Subject");
   const localLevel = localStorage.getItem("CSVDownloads.Level");
-  const localOmitSections = localStorage.getItem("CSVDownloads.OmitSections");
+  const localOmitSections = localStorage.getItem("");
   const localWithTimeLocations = localStorage.getItem(
     "CSVDownloads.WithTimeLocations",
killedBy: CSVDownloadsPage tests loads state from localStorage when available
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CSVDownloads.OmitSections-checkbox"
  type="checkbox"

[Killed] ArithmeticOperator
main/pages/CSV/CSVDownloadsPage.jsx:37:36
   );
 
   const [quarter, setQuarter] = useState(
-    localSearchQuarter || quarters[quarters.length - 1].yyyyq,
+    localSearchQuarter || quarters[quarters.length + 1].yyyyq,
   );
   const defaultSubject = "ANTH";
killedBy: CSVDownloadsPage tests renders correctly
statusReason: Cannot read properties of undefined (reading 'yyyyq')

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:37:5
   );
 
   const [quarter, setQuarter] = useState(
-    localSearchQuarter || quarters[quarters.length - 1].yyyyq,
+    false,
   );
   const defaultSubject = "ANTH";
killedBy: CSVDownloadsPage tests submitting by-quarter form downloads with the default selected quarter
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/quarter?yyyyq=20222",

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:39:26
   const [quarter, setQuarter] = useState(
     localSearchQuarter || quarters[quarters.length - 1].yyyyq,
   );
-  const defaultSubject = "ANTH";
+  const defaultSubject = "";
   const [subject, setSubject] = useState(localSearchSubject || defaultSubject);
   const [level, setLevel] = useState(localLevel || "U");
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes all new dropdown and checkbox parameters
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20222&subjectArea=ANTH&level=U&omitSections=true&withTimeLocations=true",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:40:42
     localSearchQuarter || quarters[quarters.length - 1].yyyyq,
   );
   const defaultSubject = "ANTH";
-  const [subject, setSubject] = useState(localSearchSubject || defaultSubject);
+  const [subject, setSubject] = useState(true);
   const [level, setLevel] = useState(localLevel || "U");
   const [omitSections, setOmitSections] = useState(
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes all new dropdown and checkbox parameters
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20222&subjectArea=ANTH&level=U&omitSections=true&withTimeLocations=true",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:40:42
     localSearchQuarter || quarters[quarters.length - 1].yyyyq,
   );
   const defaultSubject = "ANTH";
-  const [subject, setSubject] = useState(localSearchSubject || defaultSubject);
+  const [subject, setSubject] = useState(false);
   const [level, setLevel] = useState(localLevel || "U");
   const [omitSections, setOmitSections] = useState(
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes all new dropdown and checkbox parameters
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20222&subjectArea=ANTH&level=U&omitSections=true&withTimeLocations=true",

[Killed] LogicalOperator
main/pages/CSV/CSVDownloadsPage.jsx:41:38
   );
   const defaultSubject = "ANTH";
   const [subject, setSubject] = useState(localSearchSubject || defaultSubject);
-  const [level, setLevel] = useState(localLevel || "U");
+  const [level, setLevel] = useState(localLevel && "U");
   const [omitSections, setOmitSections] = useState(
     localOmitSections === null ? true : localOmitSections === "true",
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes all new dropdown and checkbox parameters
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20222&subjectArea=ANTH&level=U&omitSections=true&withTimeLocations=true",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:41:38
   );
   const defaultSubject = "ANTH";
   const [subject, setSubject] = useState(localSearchSubject || defaultSubject);
-  const [level, setLevel] = useState(localLevel || "U");
+  const [level, setLevel] = useState(true);
   const [omitSections, setOmitSections] = useState(
     localOmitSections === null ? true : localOmitSections === "true",
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes all new dropdown and checkbox parameters
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20222&subjectArea=ANTH&level=U&omitSections=true&withTimeLocations=true",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:43:5
   const [subject, setSubject] = useState(localSearchSubject || defaultSubject);
   const [level, setLevel] = useState(localLevel || "U");
   const [omitSections, setOmitSections] = useState(
-    localOmitSections === null ? true : localOmitSections === "true",
+    true ? true : localOmitSections === "true",
   );
   const [withTimeLocations, setWithTimeLocations] = useState(
killedBy: CSVDownloadsPage tests loads state from localStorage when available
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CSVDownloads.OmitSections-checkbox"
  type="checkbox"

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:43:5
   const [subject, setSubject] = useState(localSearchSubject || defaultSubject);
   const [level, setLevel] = useState(localLevel || "U");
   const [omitSections, setOmitSections] = useState(
-    localOmitSections === null ? true : localOmitSections === "true",
+    false ? true : localOmitSections === "true",
   );
   const [withTimeLocations, setWithTimeLocations] = useState(
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes all new dropdown and checkbox parameters
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20222&subjectArea=ANTH&level=U&omitSections=true&withTimeLocations=true",

[Killed] EqualityOperator
main/pages/CSV/CSVDownloadsPage.jsx:46:46
     localOmitSections === null ? true : localOmitSections === "true",
   );
   const [withTimeLocations, setWithTimeLocations] = useState(
-    localWithTimeLocations === null ? true : localWithTimeLocations === "true",
+    localWithTimeLocations === null ? true : localWithTimeLocations !== "true",
   );
 
killedBy: CSVDownloadsPage tests loads state from localStorage when available
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CSVDownloads.WithTimeLocations-checkbox"
  type="checkbox"

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:46:46
     localOmitSections === null ? true : localOmitSections === "true",
   );
   const [withTimeLocations, setWithTimeLocations] = useState(
-    localWithTimeLocations === null ? true : localWithTimeLocations === "true",
+    localWithTimeLocations === null ? true : true,
   );
 
killedBy: CSVDownloadsPage tests loads state from localStorage when available
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CSVDownloads.WithTimeLocations-checkbox"
  type="checkbox"

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:49:24
     localWithTimeLocations === null ? true : localWithTimeLocations === "true",
   );
 
-  const byQuarterUrl = `/api/courses/csv/quarter?yyyyq=${encodeURIComponent(quarter)}`;
+  const byQuarterUrl = ``;
   const byQuarterAndSubjectUrl =
     `/api/courses/csv/byQuarterAndSubjectArea?yyyyq=${encodeURIComponent(quarter)}` +
killedBy: CSVDownloadsPage tests submitting by-quarter form downloads with the default selected quarter
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/quarter?yyyyq=20222",

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:51:5
 
   const byQuarterUrl = `/api/courses/csv/quarter?yyyyq=${encodeURIComponent(quarter)}`;
   const byQuarterAndSubjectUrl =
-    `/api/courses/csv/byQuarterAndSubjectArea?yyyyq=${encodeURIComponent(quarter)}` +
+    `` +
     `&subjectArea=${encodeURIComponent(subject)}` +
     `&level=${encodeURIComponent(level)}` +
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes all new dropdown and checkbox parameters
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20222&subjectArea=ANTH&level=U&omitSections=true&withTimeLocations=true",

[Killed] BlockStatement
main/pages/CSV/CSVDownloadsPage.jsx:57:32
     `&omitSections=${encodeURIComponent(omitSections)}` +
     `&withTimeLocations=${encodeURIComponent(withTimeLocations)}`;
 
-  const downloadCsv = (url) => {
-    window.location.assign(url);
-  };
+  const downloadCsv = (url) => {};
 
   const handleQuarterSubmit = (e) => {
killedBy: CSVDownloadsPage tests submitting by-quarter form downloads with the default selected quarter
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
main/pages/CSV/CSVDownloadsPage.jsx:61:38
     window.location.assign(url);
   };
 
-  const handleQuarterSubmit = (e) => {
-    e.preventDefault();
-    downloadCsv(byQuarterUrl);
-  };
+  const handleQuarterSubmit = (e) => {};
 
   const handleQuarterSubjectSubmit = (e) => {
killedBy: CSVDownloadsPage tests submitting by-quarter form downloads with the default selected quarter
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
main/pages/CSV/CSVDownloadsPage.jsx:66:45
     downloadCsv(byQuarterUrl);
   };
 
-  const handleQuarterSubjectSubmit = (e) => {
-    e.preventDefault();
-    downloadCsv(byQuarterAndSubjectUrl);
-  };
+  const handleQuarterSubjectSubmit = (e) => {};
 
   const handleOmitSectionsChange = (event) => {
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes all new dropdown and checkbox parameters
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
main/pages/CSV/CSVDownloadsPage.jsx:71:47
     downloadCsv(byQuarterAndSubjectUrl);
   };
 
-  const handleOmitSectionsChange = (event) => {
-    setOmitSections(event.target.checked);
-    localStorage.setItem(
-      "CSVDownloads.OmitSections",
-      event.target.checked.toString(),
-    );
-  };
+  const handleOmitSectionsChange = (event) => {};
 
   const handleWithTimeLocationsChange = (event) => {
killedBy: CSVDownloadsPage tests checkboxes correctly trigger handlers and save to localStorage
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CSVDownloads.OmitSections-checkbox"
  type="checkbox"

[Killed] BlockStatement
main/pages/CSV/CSVDownloadsPage.jsx:79:52
     );
   };
 
-  const handleWithTimeLocationsChange = (event) => {
-    setWithTimeLocations(event.target.checked);
-    localStorage.setItem(
-      "CSVDownloads.WithTimeLocations",
-      event.target.checked.toString(),
-    );
-  };
+  const handleWithTimeLocationsChange = (event) => {};
 
   return (
killedBy: CSVDownloadsPage tests checkboxes correctly trigger handlers and save to localStorage
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CSVDownloads.WithTimeLocations-checkbox"
  type="checkbox"

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:82:7
   const handleWithTimeLocationsChange = (event) => {
     setWithTimeLocations(event.target.checked);
     localStorage.setItem(
-      "CSVDownloads.WithTimeLocations",
+      "",
       event.target.checked.toString(),
     );
killedBy: CSVDownloadsPage tests checkboxes correctly trigger handlers and save to localStorage
statusReason: expected null to be 'false' // Object.is equality

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:139:30
                   levels={allTheLevels}
                   level={level}
                   setLevel={setLevel}
-                  controlId={"CSVDownloads.Level"}
+                  controlId={""}
                   label="Course Level"
                 />
killedBy: CSVDownloadsPage tests loads state from localStorage when available
statusReason: Found a label with the text of: Course Level, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:143:32
                   label="Course Level"
                 />
                 <FormCheck
-                  data-testid={`CSVDownloads.OmitSections-checkbox`}
+                  data-testid={``}
                   label="Omit Sections"
                   onChange={handleOmitSectionsChange}
killedBy: CSVDownloadsPage tests checkboxes correctly trigger handlers and save to localStorage
statusReason: Unable to find an element by: [data-testid="CSVDownloads.OmitSections-checkbox"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:149:32
                   checked={omitSections}
                 ></FormCheck>
                 <FormCheck
-                  data-testid={`CSVDownloads.WithTimeLocations-checkbox`}
+                  data-testid={``}
                   label="Only include courses with assigned Times and Locations"
                   onChange={handleWithTimeLocationsChange}
killedBy: CSVDownloadsPage tests checkboxes correctly trigger handlers and save to localStorage
statusReason: Unable to find an element by: [data-testid="CSVDownloads.WithTimeLocations-checkbox"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
