[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:56:10
         )}
 
         {/* Results table */}
-        {!mutation.isLoading && courseJSON.length > 0 && (
-          <ConvertedSectionTable sections={courseJSON} />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
