[Killed] ArrowFunction
main/pages/EnrollmentHistory/EnrollmentHistoryIndexPage.jsx:9:31
 export default function EnrollmentHistoryIndexPage() {
   const [courseJSON, setCourseJSON] = useState([]);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/enrollmenthistory/search",
-    method: "GET",
-    params: {
-      yyyyq: query.quarter,
-      subjectArea: query.subject,
-      courseNumber: query.courseNumber + query.courseSuf,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (courses) => {
killedBy: EnrollmentHistoryIndexPage tests calls api correctly when form is submitted
statusReason: Unable to find an element with the text: /"enrollment": 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
