[Killed] ObjectLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:21:56
   const [showModal, setShowModal] = useState(false);
   const [selectedSchedule, setSelectedSchedule] = useState("");
   const [modalMode, setModalMode] = useState("normal");
-  const [scheduleParams, setScheduleParams] = useState({
-    name: "",
-    description: "",
-    quarter: quarter,
-  });
+  const [scheduleParams, setScheduleParams] = useState({});
 
   const filteringSchedules = schedulesFilter(schedules, quarter);
killedBy: AddToScheduleModal calls mutation.mutate with correct initial state when auto-creating
statusReason: expected undefined to be '20242' // Object.is equality

[Survived] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:23:18
   const [modalMode, setModalMode] = useState("normal");
   const [scheduleParams, setScheduleParams] = useState({
     name: "",
-    description: "",
+    description: "Stryker was here!",
     quarter: quarter,
   });

[Killed] ConditionalExpression
main/components/PersonalSchedules/AddToScheduleModal.jsx:87:9
   };
 
   const onSaveButtonClick = () => {
-    if (modalMode === "auto-create") {
+    if (true) {
       handleModalSaveSchedule();
     } else {
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] LogicalOperator
main/components/PersonalSchedules/AddToScheduleModal.jsx:115:15
           <Form>
             {
               /* istanbul ignore next */
-              filteringSchedules.length > 0 && modalMode === "normal" ? (
+              filteringSchedules.length > 0 || modalMode === "normal" ? (
                 <Form.Group controlId="scheduleSelect">
                   <Form.Label>Select Schedule</Form.Label>
killedBy: SectionsTable tests AddToScheduleModal interactions when there are no schedules When there are no schedules, the message about there being no schedules shows up
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.2-col-action-no-schedules"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/PersonalSchedules/AddToScheduleModal.jsx:127:20
                 </Form.Group>
               ) : (
                 <div data-testid={`${testid}-no-schedules`}>
-                  {modalMode === "auto-create" ? (
+                  {true ? (
                     <p>
                       New Schedule: <strong>{scheduleParams.name}</strong> will
killedBy: AddToScheduleModal has correct inline styles for create button
statusReason: Unable to find an element with the text: [Create Personal Schedule]. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:138:44
                       <Button
                         onClick={handleCreateClick}
                         style={{
-                          backgroundColor: "transparent",
+                          backgroundColor: "",
                           border: "none",
                           color: "#007bff",
killedBy: AddToScheduleModal has correct inline styles for create button
statusReason: expected '' to be 'transparent' // Object.is equality

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:140:34
                         style={{
                           backgroundColor: "transparent",
                           border: "none",
-                          color: "#007bff",
+                          color: "",
                           padding: 0,
                           verticalAlign: "baseline",
killedBy: AddToScheduleModal has correct inline styles for create button
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- color: rgb(0, 123, 255);

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:143:43
                           color: "#007bff",
                           padding: 0,
                           verticalAlign: "baseline",
-                          textDecoration: "underline",
+                          textDecoration: "",
                         }}
                       >
killedBy: AddToScheduleModal has correct inline styles for create button
statusReason: expected '' to contain 'underline'

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:169:51
             data-testid={`${testid}-modal-save-button`}
             disabled={mutation.isLoading}
           >
-            {mutation.isLoading ? "Creating..." : "Save Changes"}
+            {mutation.isLoading ? "Creating..." : ""}
           </Button>
         </Modal.Footer>
killedBy: AddToScheduleModal calls handleModalSave when save is clicked in normal mode with selection
statusReason: Unable to find an element with the text: Save Changes. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:169:35
             data-testid={`${testid}-modal-save-button`}
             disabled={mutation.isLoading}
           >
-            {mutation.isLoading ? "Creating..." : "Save Changes"}
+            {mutation.isLoading ? "" : "Save Changes"}
           </Button>
         </Modal.Footer>
killedBy: AddToScheduleModal renders 'Creating...' when mutation is loading
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Creating...
Received:
