[Killed] ConditionalExpression
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:21:20
 const EnrollmentHistorySearchForm = ({ fetchJSON }) => {
   const { data: systemInfo } = useSystemInfo();
 
-  const startQtr = systemInfo?.startQtrYYYYQ || "20211";
+  const startQtr = false;
   const endQtr = systemInfo?.endQtrYYYYQ || "20214";
 
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm regular tests renders correctly
statusReason: param should be a string

[Killed] StringLiteral
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:34:6
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/UCSBSubjects/all"],
+    [""],
     {
       // Stryker disable next-line StringLiteral : GET is the default, so replacing with empty string is an equivalent mutation
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm queryClient tests correct cache keys are set up and invalidated
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/UCSBSubjects/all' ], …(2) ]

Received:

  1st useBackend call:

@@ -1,8 +1,8 @@
  [

[Killed] LogicalOperator
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:45:42
 
   const defaultSubjectArea = "ANTH";
 
-  const [quarter, setQuarter] = useState(localQuarter || quarters[0].yyyyq);
+  const [quarter, setQuarter] = useState(localQuarter && quarters[0].yyyyq);
   const [subject, setSubject] = useState(
     localSubject || subjects[0]?.subjectCode || defaultSubjectArea,
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm regular tests renders correctly
statusReason: Cannot read properties of null (reading 'charAt')

[Killed] ConditionalExpression
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:45:42
 
   const defaultSubjectArea = "ANTH";
 
-  const [quarter, setQuarter] = useState(localQuarter || quarters[0].yyyyq);
+  const [quarter, setQuarter] = useState(true);
   const [subject, setSubject] = useState(
     localSubject || subjects[0]?.subjectCode || defaultSubjectArea,
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm regular tests renders correctly
statusReason: yyyyq.charAt is not a function

[Killed] OptionalChaining
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:47:21
 
   const [quarter, setQuarter] = useState(localQuarter || quarters[0].yyyyq);
   const [subject, setSubject] = useState(
-    localSubject || subjects[0]?.subjectCode || defaultSubjectArea,
+    localSubject || subjects[0].subjectCode || defaultSubjectArea,
   );
   const [courseNumber, setCourseNumber] = useState("");
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm regular tests renders correctly
statusReason: Cannot read properties of undefined (reading 'subjectCode')

[Killed] ConditionalExpression
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:47:5
 
   const [quarter, setQuarter] = useState(localQuarter || quarters[0].yyyyq);
   const [subject, setSubject] = useState(
-    localSubject || subjects[0]?.subjectCode || defaultSubjectArea,
+    true,
   );
   const [courseNumber, setCourseNumber] = useState("");
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm regular tests renders correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^ANTH$/
Received:
  true

[Killed] BlockStatement
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:52:35
   const [courseNumber, setCourseNumber] = useState("");
   const [courseSuf, setCourseSuf] = useState("");
 
-  const submitAction = (event) => {
-    fetchJSON(event, {
-      quarter,
-      subject,
-      courseNumber,
-      courseSuf,
-    });
-  };
+  const submitAction = (event) => {};
 
   const handleCourseNumberOnChange = (event) => {
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm regular tests when I click submit, the right stuff happens
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:85:26
               quarters={quarters}
               quarter={quarter}
               setQuarter={setQuarter}
-              controlId={"EnrollmentHistorySearch.Quarter"}
+              controlId={""}
               label={"Quarter"}
             />
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm regular tests renders correctly
statusReason: Found a label with the text of: Quarter, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="EnrollmentHistorySearchForm"

[Killed] StringLiteral
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:94:26
               subjects={subjects}
               subject={subject}
               setSubject={setSubject}
-              controlId={"EnrollmentHistorySearch.Subject"}
+              controlId={""}
               label={"Subject Area"}
             />
killedBy: EnrollmentHistoryIndexPage tests calls api correctly when form is submitted
statusReason: Found a label with the text of: Subject Area, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:103:30
               <Form.Label>Course Number</Form.Label>
               <Form.Control
                 isInvalid={Boolean(errors.EnrollmentHistorySearchCourseNumber)}
-                {...register("EnrollmentHistorySearchCourseNumber", {
+                {...register("", {
                   pattern: courseNumRegex,
                   onChange: (e) => handleCourseNumberOnChange(e), // Here's the fix!
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm regular tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:103:69
               <Form.Label>Course Number</Form.Label>
               <Form.Control
                 isInvalid={Boolean(errors.EnrollmentHistorySearchCourseNumber)}
-                {...register("EnrollmentHistorySearchCourseNumber", {
-                  pattern: courseNumRegex,
-                  onChange: (e) => handleCourseNumberOnChange(e), // Here's the fix!
-                })}
+                {...register("EnrollmentHistorySearchCourseNumber", {})}
               />
               <Form.Text muted>
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm regular tests when I select a course number without suffix, the state for course number changes
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^ANTH 24$/
Received:
  ANTH

[Killed] ConditionalExpression
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:112:18
                 {"For example: '16' or '130A'; omit the subject area prefix."}
               </Form.Text>
               <Form.Control.Feedback type="invalid">
-                {errors.EnrollmentHistorySearchCourseNumber &&
-                  "Course Number is required. "}
+                {false}
                 {errors.EnrollmentHistorySearchCourseNumber?.type ===
                   "pattern" &&
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm test for form validations on CourseNumber validates course number format
statusReason: Unable to find an element with the text: /Course Number is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="EnrollmentHistorySearchForm"

[Killed] ConditionalExpression
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:112:18
                 {"For example: '16' or '130A'; omit the subject area prefix."}
               </Form.Text>
               <Form.Control.Feedback type="invalid">
-                {errors.EnrollmentHistorySearchCourseNumber &&
-                  "Course Number is required. "}
+                {true}
                 {errors.EnrollmentHistorySearchCourseNumber?.type ===
                   "pattern" &&
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm test for form validations on CourseNumber validates course number format
statusReason: Unable to find an element with the text: /Course Number is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="EnrollmentHistorySearchForm"

[Killed] StringLiteral
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:113:19
               </Form.Text>
               <Form.Control.Feedback type="invalid">
                 {errors.EnrollmentHistorySearchCourseNumber &&
-                  "Course Number is required. "}
+                  ""}
                 {errors.EnrollmentHistorySearchCourseNumber?.type ===
                   "pattern" &&
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm test for form validations on CourseNumber validates course number format
statusReason: Unable to find an element with the text: /Course Number is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="EnrollmentHistorySearchForm"

[Killed] LogicalOperator
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:114:18
               <Form.Control.Feedback type="invalid">
                 {errors.EnrollmentHistorySearchCourseNumber &&
                   "Course Number is required. "}
-                {errors.EnrollmentHistorySearchCourseNumber?.type ===
-                  "pattern" &&
-                  "Course number should be a 1 to 3 digit number, optionally followed by up to two letters."}
+                {errors.EnrollmentHistorySearchCourseNumber?.type === "pattern" || "Course number should be a 1 to 3 digit number, optionally followed by up to two letters."}
               </Form.Control.Feedback>
             </Form.Group>
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm regular tests when I click submit, the right stuff happens
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Course number should be a 1 to 3 digit number, optionally followed by up to two letters.
</div> instead

[Killed] ConditionalExpression
main/components/BasicCourseSearch/EnrollmentHistorySearchForm.jsx:114:18
               <Form.Control.Feedback type="invalid">
                 {errors.EnrollmentHistorySearchCourseNumber &&
                   "Course Number is required. "}
-                {errors.EnrollmentHistorySearchCourseNumber?.type ===
-                  "pattern" &&
-                  "Course number should be a 1 to 3 digit number, optionally followed by up to two letters."}
+                {true}
               </Form.Control.Feedback>
             </Form.Group>
killedBy: EnrollmentHistorySearchForm tests EnrollmentHistorySearchForm test for form validations on CourseNumber validates course number format
statusReason: Unable to find an element with the text: /Course number should be a 1 to 3 digit number, optionally followed by up to two letters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="Enr
