[Killed] BooleanLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:18:46
   schedules,
   testid = "AddToScheduleModal",
 }) {
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
   const [selectedSchedule, setSelectedSchedule] = useState("");
   const [modalMode, setModalMode] = useState("normal");
killedBy: SectionsTable tests objectToAxiosParams wired into useBackendMutation passes a function that builds correct axios params
statusReason: expected "vi.fn()" to be called 2 times, but got 4 times

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:20:46
 }) {
   const [showModal, setShowModal] = useState(false);
   const [selectedSchedule, setSelectedSchedule] = useState("");
-  const [modalMode, setModalMode] = useState("normal");
+  const [modalMode, setModalMode] = useState("");
   const [scheduleParams, setScheduleParams] = useState({
     // Stryker disable next-line StringLiteral : initial values are overwritten before use
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="SectionsTable-cell-row-0.1-col-action-no-schedules"
>
  <p>
    There are no personal schedules for 
    F24

[Killed] ObjectLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:21:56
   const [showModal, setShowModal] = useState(false);
   const [selectedSchedule, setSelectedSchedule] = useState("");
   const [modalMode, setModalMode] = useState("normal");
-  const [scheduleParams, setScheduleParams] = useState({
-    // Stryker disable next-line StringLiteral : initial values are overwritten before use
-    name: "",
-    // Stryker disable next-line StringLiteral : initial values are overwritten before use
-    description: "",
-    quarter: quarter,
-  });
+  const [scheduleParams, setScheduleParams] = useState({});
 
   const filteringSchedules = schedulesFilter(schedules, quarter);
killedBy: AddToScheduleModal calls mutation.mutate with correct initial state when auto-creating
statusReason: expected undefined to be '20242' // Object.is equality

[Killed] ArrowFunction
main/components/PersonalSchedules/AddToScheduleModal.jsx:31:31
 
   const filteringSchedules = schedulesFilter(schedules, quarter);
 
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules/post",
-    method: "POST",
-    params: {
-      name: personalSchedule.name,
-      description: personalSchedule.description,
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (data) => {
killedBy: AddToScheduleModal objectToAxiosParams works as expected
statusReason: expected undefined to deeply equal { …(3) }

[Killed] ObjectLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:31:54
 
   const filteringSchedules = schedulesFilter(schedules, quarter);
 
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules/post",
-    method: "POST",
-    params: {
-      name: personalSchedule.name,
-      description: personalSchedule.description,
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = (personalSchedule) => ({});
 
   const onSuccess = (data) => {
killedBy: AddToScheduleModal objectToAxiosParams works as expected
statusReason: expected {} to deeply equal { …(3) }

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:32:10
   const filteringSchedules = schedulesFilter(schedules, quarter);
 
   const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules/post",
+    url: "",
     method: "POST",
     params: {
killedBy: AddToScheduleModal objectToAxiosParams works as expected
statusReason: expected { url: '', method: 'POST', …(1) } to deeply equal { …(3) }

[Killed] ObjectLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:34:13
   const objectToAxiosParams = (personalSchedule) => ({
     url: "/api/personalschedules/post",
     method: "POST",
-    params: {
-      name: personalSchedule.name,
-      description: personalSchedule.description,
-      quarter: personalSchedule.quarter,
-    },
+    params: {},
   });
 
killedBy: AddToScheduleModal objectToAxiosParams works as expected
statusReason: expected { …(3) } to deeply equal { …(3) }

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.jsx:41:31
     },
   });
 
-  const onSuccess = (data) => {
-    toast(`Schedule "${data.name}" Created`);
-    onAdd(section, data.id);
-    handleModalClose();
-  };
+  const onSuccess = (data) => {};
 
   const onError = (error) => {
killedBy: AddToScheduleModal onSuccess and onError work as expected
statusReason: expected "vi.fn()" to be called with arguments: [ 'Schedule "Test Schedule" Created' ]

Number of calls: 0

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.jsx:47:30
     handleModalClose();
   };
 
-  const onError = (error) => {
-    toast(`Error: ${error.response.data.message}`);
-  };
+  const onError = (error) => {};
 
   const mutation = useBackendMutation(
killedBy: AddToScheduleModal onSuccess and onError work as expected
statusReason: expected "vi.fn()" to be called with arguments: [ 'Error: Stub Error' ]

Received:

  1st vi.fn() call:

  [
-   "Error: Stub Error",

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:48:11
   };
 
   const onError = (error) => {
-    toast(`Error: ${error.response.data.message}`);
+    toast(``);
   };
 
killedBy: AddToScheduleModal onSuccess and onError work as expected
statusReason: expected "vi.fn()" to be called with arguments: [ 'Error: Stub Error' ]

Received:

  1st vi.fn() call:

  [
-   "Error: Stub Error",

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.jsx:58:34
     ["/api/personalschedules/all"],
   );
 
-  const handleModalClose = () => {
-    setShowModal(false);
-    setModalMode("normal");
-  };
+  const handleModalClose = () => {};
 
   const handleModalSave = () => {
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.jsx:68:41
     handleModalClose();
   };
 
-  const handleModalSaveSchedule = () => {
-    mutation.mutate(scheduleParams);
-  };
+  const handleModalSaveSchedule = () => {};
 
   const handleCreateClick = () => {
killedBy: AddToScheduleModal calls mutation.mutate with correct initial state when auto-creating
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.jsx:72:35
     mutation.mutate(scheduleParams);
   };
 
-  const handleCreateClick = () => {
-    const timeString = new Date().toLocaleString([], {
-      month: "short",
-      day: "numeric",
-      hour: "2-digit",
-      minute: "2-digit",
-    });
-
-    setScheduleParams({
-      ...scheduleParams,
-      name: `${timeString} Schedule`,
-      description: "Auto-generated schedule",
-    });
-    setModalMode("auto-create");
-  };
+  const handleCreateClick = () => {};
 
   const onSaveButtonClick = () => {
killedBy: AddToScheduleModal formats the timeString correctly in auto-create mode
statusReason: Unable to find an element with the text: /New Schedule:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ArrayDeclaration
main/components/PersonalSchedules/AddToScheduleModal.jsx:73:50
   };
 
   const handleCreateClick = () => {
-    const timeString = new Date().toLocaleString([], {
+    const timeString = new Date().toLocaleString(["Stryker was here"], {
       month: "short",
       day: "numeric",
killedBy: AddToScheduleModal formats the timeString correctly in auto-create mode
statusReason: Unable to find an element with the text: /New Schedule:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:74:14
 
   const handleCreateClick = () => {
     const timeString = new Date().toLocaleString([], {
-      month: "short",
+      month: "",
       day: "numeric",
       hour: "2-digit",
killedBy: AddToScheduleModal formats the timeString correctly in auto-create mode
statusReason: Unable to find an element with the text: /New Schedule:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:82:13
 
     setScheduleParams({
       ...scheduleParams,
-      name: `${timeString} Schedule`,
+      name: ``,
       description: "Auto-generated schedule",
     });
killedBy: AddToScheduleModal formats the timeString correctly in auto-create mode
statusReason: expected 'New Schedule:  will be created.' to match /[A-Z][a-z]{2} \d{1,2}, \d{1,2}:\d{2}[…/

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:83:20
     setScheduleParams({
       ...scheduleParams,
       name: `${timeString} Schedule`,
-      description: "Auto-generated schedule",
+      description: "",
     });
     setModalMode("auto-create");
killedBy: AddToScheduleModal calls mutation.mutate with correct initial state when auto-creating
statusReason: expected '' to be 'Auto-generated schedule' // Object.is equality

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.jsx:88:35
     setModalMode("auto-create");
   };
 
-  const onSaveButtonClick = () => {
-    if (modalMode === "auto-create") {
-      handleModalSaveSchedule();
-    } else {
-      handleModalSave();
-    }
-  };
+  const onSaveButtonClick = () => {};
 
   return (
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] EqualityOperator
main/components/PersonalSchedules/AddToScheduleModal.jsx:89:9
   };
 
   const onSaveButtonClick = () => {
-    if (modalMode === "auto-create") {
+    if (modalMode !== "auto-create") {
       handleModalSaveSchedule();
     } else {
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.jsx:89:38
   };
 
   const onSaveButtonClick = () => {
-    if (modalMode === "auto-create") {
-      handleModalSaveSchedule();
-    } else {
+    if (modalMode === "auto-create") {} else {
       handleModalSave();
     }
killedBy: AddToScheduleModal calls mutation.mutate with correct initial state when auto-creating
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.jsx:91:12
   const onSaveButtonClick = () => {
     if (modalMode === "auto-create") {
       handleModalSaveSchedule();
-    } else {
-      handleModalSave();
-    }
+    } else {}
   };
 
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BooleanLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:100:37
     <>
       <Button
         variant="success"
-        onClick={() => setShowModal(true)}
+        onClick={() => setShowModal(false)}
         data-testid={`${testid}-add-to-schedule-button`}
       >
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ArrowFunction
main/components/PersonalSchedules/AddToScheduleModal.jsx:100:18
     <>
       <Button
         variant="success"
-        onClick={() => setShowModal(true)}
+        onClick={() => undefined}
         data-testid={`${testid}-add-to-schedule-button`}
       >
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:101:22
       <Button
         variant="success"
         onClick={() => setShowModal(true)}
-        data-testid={`${testid}-add-to-schedule-button`}
+        data-testid={``}
       >
         Add
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-add-to-schedule-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ConditionalExpression
main/components/PersonalSchedules/AddToScheduleModal.jsx:117:48
           <Form>
             {
               /* istanbul ignore next */
-              filteringSchedules.length > 0 && modalMode === "normal" ? (
+              filteringSchedules.length > 0 && true ? (
                 <Form.Group controlId="scheduleSelect">
                   <Form.Label>Select Schedule</Form.Label>
killedBy: AddToScheduleModal auto-create mode does not show selector even if schedules exist
statusReason: Unable to find an element with the text: /New Schedule:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/PersonalSchedules/AddToScheduleModal.jsx:117:15
           <Form>
             {
               /* istanbul ignore next */
-              filteringSchedules.length > 0 && modalMode === "normal" ? (
+              true ? (
                 <Form.Group controlId="scheduleSelect">
                   <Form.Label>Select Schedule</Form.Label>
killedBy: SectionsTable tests AddToScheduleModal interactions when there are no schedules When there are no schedules, the message about there being no schedules shows up
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.2-col-action-no-schedules"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/PersonalSchedules/AddToScheduleModal.jsx:129:20
                 </Form.Group>
               ) : (
                 <div data-testid={`${testid}-no-schedules`}>
-                  {modalMode === "auto-create" ? (
+                  {false ? (
                     <p>
                       New Schedule: <strong>{scheduleParams.name}</strong> will
killedBy: AddToScheduleModal formats the timeString correctly in auto-create mode
statusReason: Unable to find an element with the text: /New Schedule:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] EqualityOperator
main/components/PersonalSchedules/AddToScheduleModal.jsx:129:20
                 </Form.Group>
               ) : (
                 <div data-testid={`${testid}-no-schedules`}>
-                  {modalMode === "auto-create" ? (
+                  {modalMode !== "auto-create" ? (
                     <p>
                       New Schedule: <strong>{scheduleParams.name}</strong> will
killedBy: AddToScheduleModal has correct inline styles for create button
statusReason: Unable to find an element with the text: [Create Personal Schedule]. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:144:42
                           border: "none",
                           color: "#007bff",
                           padding: 0,
-                          verticalAlign: "baseline",
+                          verticalAlign: "",
                           textDecoration: "underline",
                         }}
killedBy: AddToScheduleModal has correct inline styles for create button
statusReason: expected '' to be 'baseline' // Object.is equality

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:161:26
           <Button
             variant="secondary"
             onClick={handleModalClose}
-            data-testid={`${testid}-modal-close-button`}
+            data-testid={``}
           >
             Close
killedBy: SectionsTable tests AddToScheduleModal interactions without mocking backend mutation Add to schedule modal opens and closes correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-modal-close-button"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
