[Killed] ArrayDeclaration
main/pages/EnrollmentHistory/EnrollmentHistoryIndexPage.jsx:7:48
 import { useBackendMutation } from "main/utils/useBackend";
 
 export default function EnrollmentHistoryIndexPage() {
-  const [courseJSON, setCourseJSON] = useState([]);
+  const [courseJSON, setCourseJSON] = useState(["Stryker was here"]);
 
   const objectToAxiosParams = (query) => ({
killedBy: EnrollmentHistoryIndexPage tests initial state is empty
statusReason: Unable to find an element with the text: []. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/EnrollmentHistory/EnrollmentHistoryIndexPage.jsx:9:31
 export default function EnrollmentHistoryIndexPage() {
   const [courseJSON, setCourseJSON] = useState([]);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/enrollmenthistory/search",
-    // Stryker disable next-line StringLiteral : Axios defaults to GET, making this an equivalent mutant impossible to kill
-    method: "GET",
-    params: {
-      yyyyq: query.quarter,
-      subjectArea: query.subject,
-      courseNumber: query.courseNumber + query.courseSuf,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (courses) => {
killedBy: EnrollmentHistoryIndexPage tests calls api correctly when form is submitted
statusReason: Unable to find an element with the text: /"enrollment": 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/EnrollmentHistory/EnrollmentHistoryIndexPage.jsx:10:10
   const [courseJSON, setCourseJSON] = useState([]);
 
   const objectToAxiosParams = (query) => ({
-    url: "/api/public/enrollmenthistory/search",
+    url: "",
     // Stryker disable next-line StringLiteral : Axios defaults to GET, making this an equivalent mutant impossible to kill
     method: "GET",
killedBy: EnrollmentHistoryIndexPage tests calls api correctly when form is submitted
statusReason: Unable to find an element with the text: /"enrollment": 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/EnrollmentHistory/EnrollmentHistoryIndexPage.jsx:13:13
     url: "/api/public/enrollmenthistory/search",
     // Stryker disable next-line StringLiteral : Axios defaults to GET, making this an equivalent mutant impossible to kill
     method: "GET",
-    params: {
-      yyyyq: query.quarter,
-      subjectArea: query.subject,
-      courseNumber: query.courseNumber + query.courseSuf,
-    },
+    params: {},
   });
 
killedBy: EnrollmentHistoryIndexPage tests calls api correctly when form is submitted
statusReason: expected {} to deeply equal { yyyyq: '20211', …(2) }

[Killed] ArithmeticOperator
main/pages/EnrollmentHistory/EnrollmentHistoryIndexPage.jsx:16:21
     params: {
       yyyyq: query.quarter,
       subjectArea: query.subject,
-      courseNumber: query.courseNumber + query.courseSuf,
+      courseNumber: query.courseNumber - query.courseSuf,
     },
   });
killedBy: EnrollmentHistoryIndexPage tests calls api correctly when form is submitted
statusReason: expected { yyyyq: '20211', …(2) } to deeply equal { yyyyq: '20211', …(2) }

[Killed] BlockStatement
main/pages/EnrollmentHistory/EnrollmentHistoryIndexPage.jsx:31:60
     [],
   );
 
-  async function fetchEnrollmentHistoryJSON(_event, query) {
-    mutation.mutate(query);
-  }
+  async function fetchEnrollmentHistoryJSON(_event, query) {}
 
   return (
killedBy: EnrollmentHistoryIndexPage tests calls api correctly when form is submitted
statusReason: Unable to find an element with the text: /"enrollment": 50/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
